[RM_Biotic X2SoldierClassTemplate]
+DisplayName="Biotic"
+ClassSummary="The Biotic utilizes element zero nodules in their body, manipulating dark energy for offensive and defensive purposes."

AbilityTreeTitles[0]="Vanguard"
AbilityTreeTitles[1]="Guardian"
AbilityTreeTitles[2]="Adept"
AbilityTreeTitles[3]="XCOM"

+RandomNickNames[0]="Overlord"
+RandomNickNames[1]="Battlemaster"
+RandomNickNames[2]="Gladiator"
+RandomNickNames[3]="Cabal"
+RandomNickNames[4]="Relativity"
+RandomNickNames[5]="Machina"
+RandomNickNames[6]="Big Bang"
+RandomNickNames[7]="Hawking"
+RandomNickNames[8]="Kerr"
+RandomNickNames[9]="Cosmic"
+RandomNickNames[10]="Quantum"
+RandomNickNames[11]="Mass Effect"
+RandomNickNames[12]="Fractured"
+RandomNickNames[13]="Biotic God"

; *********************************************************************************************************************
; ***				        SQUADDIE ABILITIES																		***
; *********************************************************************************************************************
[RM_BioticStrength X2AbilityTemplate]
LocFriendlyName="Biotic Strength"
LocLongDescription="Biotic strength is measured the same way we measure psionic strength; and the stronger it grows, the stronger the biotic's attacks will be. This ability also reflects a Biotic's ability to move faster with lighter weaponry."
LocHelpText="Biotic strength is measured the same way we measure psionic strength; and the stronger it grows, the stronger the biotic's attacks will be. This ability also reflects a Biotic's ability to move faster with lighter weaponry."
LocFlyOverText="Biotic Strength"
LocPromotionPopupText="<Bullet/> Biotic attacks, excluding Singularity and Annihiliation Field, will gain bonus amounts of damage for every 50 points of psi strength the biotic has.<br/> <Bullet/> A biotic gets +<Ability:BIOTICBULLPUP/> or +<Ability:BIOTICPISTOL/> points of mobility with weapons lighter than shotgun: +<Ability:BIOTICBULLPUP/> for a bullpup, +<Ability:BIOTICPISTOL/> for a pistol. They also get +<Ability:BIOTICAIMBONUS> Aim for a lighter weapon."

[RM_BioticBarrier X2AbilityTemplate]
LocFriendlyName="Biotic Barrier"
LocLongDescription="A biotic that has begun training their abilities first learns how to create a dark energy field that can protect them from damage, and how to regenerate that field even when it's destroyed."
LocHelpText="Biotics start with <Ability:BIOTIC_BARRIER/> point strong barriers, and can regain <Ability:BIOTICREGEN/> point(s) per turn."
LocFlyOverText="Biotic Barrier"
LocPromotionPopupText="<Bullet/>Biotics start with <Ability:BIOTIC_BARRIER/> point strong barriers, and can regain <Ability:BIOTICREGEN/> point(s) per turn.<br/>"

[RM_BioticRebuild X2AbilityTemplate]
LocFriendlyName="Biotic Barrier"
LocLongDescription="A biotic that has begun training their abilities first learns how to create a dark energy field that can protect them from damage, and how to regenerate that field even when it's destroyed."
LocHelpText="Biotics start with <Ability:BIOTIC_BARRIER/> point strong barriers, and can regain <Ability:BIOTICREGEN/> point(s) per turn."
LocFlyOverText="Biotic Barrier"

[RM_BioticRegen X2AbilityTemplate]
LocFriendlyName="Biotic Regen"
LocLongDescription="A biotic that has begun training their abilities first learns how to create a dark energy field that can protect them from damage, and how to regenerate that field even when it's destroyed."
LocHelpText="Biotics start with <Ability:BIOTIC_BARRIER/> point strong barriers, and can regain <Ability:BIOTICREGEN/> point(s) per turn. Regeneration can go faster with a high enough psi offence score."
LocFlyOverText="Biotic Regen"



; *********************************************************************************************************************
; ***				        VANGUARD ABILITIES																		***
; *********************************************************************************************************************

[RM_Charge X2AbilityTemplate]
LocFriendlyName="Charge"
LocLongDescription="A biotic, using a given enemy's electrical presence in the field, can travel directly to the target, delivering high amounts of damage and bypassing any overwatch. Will also disorient or stun nearby targets."
LocHelpText="Charge to an enemy's location via dark energy. Bypasses all overwatch and reaction fire. Disorient or stuns nearby targets."
LocFlyOverText="Charge"
LocPromotionPopupText="<Bullet/>Charge to an enemy's location via dark energy. Bypasses all overwatch and reaction fire. Requires line of sight to the target.<br/><Bullet/>Has a <Ability:SelfCooldown/> turn cooldown.<br/><Bullet/>Disorient and stun chance is a test of the enemy's will score against the biotic's psi offence stat.<br/><Bullet/>The disorientation/stun effect is rolled against all targets within a variable number of tiles of the enemy target.<br/><Bullet/>Radius size is default 4 tiles, but is increased or decreased by the biotic's psi offence score.<br/><Bullet/>Provides a move only action point to allow the biotic to reposition.<br/>"

[RM_Backlash X2AbilityTemplate]
LocFriendlyName="Backlash"
LocLongDescription="The biotic focuses their biotic barrier into a reflective barrier, deflecting all projectile damage back at the attackers."
LocHelpText="Deflects projectile damage back at attackers. Only works on direct damage attacks."
LocFlyOverText="Backlash"
LocPromotionPopupText="<Bullet/>Backlash only works on the primary weapons of enemies like the Viper, Muton, or ADVENT Officer: it won't work on explosions or psi-attacks.<br/><Bullet/>Has a <Ability:SelfCooldown/> turn cooldown.<br/><Bullet/>Backlash only stays active as long as the biotic has shield points remaining.<br/>"

[RM_BacklashShot X2AbilityTemplate]
LocFriendlyName="Backlash"
LocLongDescription="The biotic focuses their biotic barrier into a reflective barrier, deflecting all projectile damage back at the attackers."
LocHelpText="Deflects projectile damage back at attackers. Only works on direct damage attacks."
LocFlyOverText="Backlash"
LocPromotionPopupText="<Bullet/>Backlash only works on the primary weapons of enemies like the Viper, Muton, or ADVENT Officer: it won't work on explosions or psi-attacks.<br/><Bullet/>Has a <Ability:SelfCooldown/> turn cooldown.<br/><Bullet/>Backlash only stays active as long as the biotic has shield points remaining.<br/>"

[RM_Nova X2AbilityTemplate]
LocFriendlyName="Nova"
LocLongDescription="Nova lets a biotic use part of their barrier as energy for a devastating attack around them."
LocHelpText="Pound into the ground, delivering a devastating attack around the biotic"
LocFlyOverText="Nova"
LocPromotionPopupText="<Bullet/>Damages all targets in a variable tile radius around the biotic.<br/><Bullet/>Radius size is by default 5 tiles, but decreases or increases depending on the biotic's psi offence score.<br/><Bullet/>Has a <Ability:SelfCooldown/> turn cooldown.<br/><Bullet/>Requires and consumes 3 shield points every time it's used.<br/>"

[RM_Aegis X2AbilityTemplate]
LocFriendlyName="Aegis"
LocLongDescription="The biotic's barrier will now block all overflow damage in its last moment of existence."
LocHelpText="The biotic's barrier will now block all overflow damage in its last moment of existence."
LocFlyOverText="Aegis"
LocPromotionPopupText="<Bullet/>The biotic will avoid taking damage in the last moment of their barrier's existence, even if it's only 1 shield point against 30 points of damage.<br/>"

[RM_BioticNerves X2AbilityTemplate]
LocFriendlyName="Biotic Aptitude"
LocLongDescription="All biotic abilities with cooldown now take one less turn to recharge."
LocHelpText="All biotic abilities with cooldown now take one less turn to recharge."
LocFlyOverText="Nerves"
LocPromotionPopupText="<Bullet/>Nova can be a devastating ability with this passive.<br/>"

[RM_BioticOverdrive X2AbilityTemplate]
LocFriendlyName="Biotic Overdrive"
LocLongDescription="All biotic abilities reset their cooldowns, will no longer end the turn excluding Backlash, and gain an extra action point for the rest of the turn."
LocHelpText="All biotic abilities reset their cooldowns, will no longer end the turn excluding Backlash, and gain an extra action point for the rest of the turn."
LocFlyOverText="Nerves"
LocPromotionPopupText="<Bullet/>Biotic Overdrive can help turnaround a battle with its ability to let you immediately use a biotic's powers.<br/>"

[RM_ExplodingBiotics X2AbilityTemplate]
LocFriendlyName="Stunning Biotics"
LocLongDescription="AOE Biotic attacks have their radii increased by 2, and will disorient any targets caught within."
LocHelpText="AOE Biotic attacks have their radii increased by 2, and will disorient any targets caught within."
LocFlyOverText="Stunning Biotics"
LocPromotionPopupText="<Bullet/>Abilities included are Nova, Annihilation Field, Charge's group stun effect and Singularity.<br/>"



; *********************************************************************************************************************
; ***                     GUARDIAN ABILITIES																		***
; *********************************************************************************************************************
[RM_RuptureField X2AbilityTemplate]
LocFriendlyName="Annihilation Field"
LocLongDescription="Annihilation Field lets a biotic rupture any targets within a variable amount of tiles for at least +6 rupture."
LocHelpText="Annihilation Field lets a biotic rupture any targetswithin a variable amount of tiles for at least +6 rupture."
LocFlyOverText="Annihilated!"
LocPromotionPopupText="<Bullet/> Annihilation Field lets a biotic rupture any targets within a variable amount of tiles for at least +6 rupture.<br/> <Bullet/> Radius size is by default 6, but increases or decreases depending on the biotic's psi stat. Rupture scales with the biotic's biotic amp.<br/> <Bullet/> Ability activates at the end of the biotic's turn."

[RM_WarpShot X2AbilityTemplate]
LocFriendlyName="Warp Shot"
LocLongDescription="The biotic infuses their abilities into their weapon, delivering a guaranteed shot with their primary weapon and ensures that the target takes an additional +<Ability:WarpShotAmount/> damage from all attacks in the future."
LocHelpText="A Warp shot deals guaranteed damage and ensures that the target takes increased damage from all attacks in the future."
LocFlyOverText="Warp Shot"
LocPromotionPopupText="<Bullet/> Warp Shot requires <Ability:SelfAmmoCost/> ammo points and has a <Ability:SelfCooldown/> turn cooldown.<br/><Bullet/> Ruptured targets take <Ability:RuptureAmount/> additional damage from every attack.<br/>"

[RM_ReactiveBarrier X2AbilityTemplate]
LocFriendlyName="Reactive Barrier"
LocLongDescription="The biotic's barrier reflexes have been trained to the point where the barrier hardens against incoming impacts, reducing incoming damage taken by <Ability:ReactiveBarrier/>%."
LocHelpText="Reduces damage taken by <Ability:ReactiveBarrier/>%."
LocFlyOverText="Reactive Barrier"
LocPromotionPopupText="<Bullet/> Reactive Barrier reduces damage taken by <Ability:ReactiveBarrier/>%.<br/>"

[RM_Safeguard X2AbilityTemplate]
LocFriendlyName="Safeguard"
LocLongDescription="This allows a biotic to maximize the potential of their barrier, being able to defend themselves against even stronger threats."
LocHelpText="This biotic now starts with <Ability:SAFEGUARD/> point strong barriers, and can regain <Ability:BIOTICREGEN/> point(s) per turn."
LocFlyOverText="Safeguard"
LocPromotionPopupText="<Bullet/>This biotic now starts with <Ability:SAFEGUARD/> point strong barriers, and can regain <Ability:BIOTICREGEN/> point(s) per turn.<br/>"

[RM_SafeguardRegen X2AbilityTemplate]
LocFriendlyName="Safeguard Regen"
LocLongDescription="This allows a biotic to maximize the potential of their barrier, being able to defend themselves against even stronger threats."
LocHelpText="This biotic now starts with <Ability:SAFEGUARD/> point strong barriers, and can regain <Ability:BIOTICREGEN/> point(s) per turn. Regeneration can go faster with a high enough psi offence score."
LocFlyOverText="Safeguard Regen"

[RM_SafeguardRebuild X2AbilityTemplate]
LocFriendlyName="Safeguard"
LocLongDescription="This allows a biotic to maximize the potential of their barrier, being able to defend themselves against even stronger threats."
LocHelpText="This biotic now starts with <Ability:SAFEGUARD/> point strong barriers, and can regain <Ability:BIOTICREGEN/> point(s) per turn."
LocFlyOverText="Safeguard"
LocPromotionPopupText="<Bullet/>This biotic now starts with <Ability:SAFEGUARD/> point strong barriers, and can regain <Ability:BIOTICREGEN/> point(s) per turn.<br/>"


[RM_BioticTraversal X2AbilityTemplate]
LocFriendlyName="Biotic Traversal"
LocFlyOverText="Biotic Traversal"
LocLongDescription="Seamlessly travel to rooftops without needing ladders, poles, etc. Also gain +<Ability:BIOTICDEFENCE/> defence."
LocHelpText="Seamlessly travel to rooftops without needing ladders, poles, etc. Also gain +<Ability:BIOTICDEFENCE/> defence."
LocPromotionPopupText="<Bullet/> Seamlessly travel to rooftops without needing ladders, poles, etc. Also gain +<Ability:BIOTICDEFENCE/> defence.<br/>"

[RM_BioticTeleport X2AbilityTemplate]
LocFriendlyName="Biotic Teleport"
LocLongDescription="A biotic can teleport to distant locations instead of moving directly. Bypasses all overwatch and reaction fire. Limited to a <Ability:BIOTICTELEPORT/> tile range."
LocHelpText="Teleport to a new location. Bypasses all overwatch and reaction fire. Limited to a <Ability:BIOTICTELEPORT/> tile range."
LocFlyOverText="Biotic Teleport"
LocPromotionPopupText="<Bullet/>Teleport to a new location. Bypasses all overwatch and reaction fire. Limited to a <Ability:BIOTICTELEPORT/> tile range.<br/><Bullet/>Has a <Ability:SelfCooldown/> turn cooldown.<br/>"

[RM_BioticWind X2AbilityTemplate]
LocFriendlyName="Saving Barrier"
LocLongDescription="If the Biotic takes enough damage to be killed, they are immediately put in Stasis for 1 turn, their health is only reduced to 1 HP, and their barrier is set to 10 shield HP. This can only happen once per mission."
LocHelpText="If the Psi Operative takes enough damage to be killed, they are immediately put in Stasis for 1 turn, their health is only reduced to 1 HP, and their barrier is set to 10 shield HP.This can only happen once per mission."
LocFlyOverText="Saving Barrier"
LocPromotionPopupText="<Bullet/> Beware that a saved Biotic may retain damaging status effects like poison or burning after emerging from Stasis.<br/>"

[RM_BioticWindTriggered X2AbilityTemplate]
LocFriendlyName="Saved"
LocLongDescription="The Biotic would have died, but was saved and put into Stasis for 1 turn. This cannot happen again during this mission."
LocHelpText="The Biotic would have died, but was saved and put into Stasis for 1 turn. This cannot happen again during this mission."
LocFlyOverText="Saved"


; *********************************************************************************************************************
; ***                     ADEPT ABILITIES																			***
; *********************************************************************************************************************
[RM_Warp X2AbilityTemplate]
LocFriendlyName="Warp"
LocLongDescription="A biotic can generate a series of rapidly shifting mass effect fields on a target, warping and rupturing a target with a homing attack. Has a <Ability:SelfCooldown/> turn cooldown."
LocHelpText="Deal a select amount of damage plus rupture the target for at least +2 damage on all future attacks."
LocFlyOverText="Warped"
LocPromotionPopupText="<Bullet/>Deal a select amount of damage plus rupture the target for at least +2 damage on all future attacks.<br/> <Bullet/> Damage scales with the tech level of the amp the biotic has equipped.<br/><Bullet/>Has a <Ability:SelfCooldown/> turn cooldown.<br/>"

[RM_Lance X2AbilityTemplate]
LocFriendlyName="Lance"
LocLongDescription="A biotic can generate a shaft of dark energy, throwing it at targets being spotted even at squadsight range. Shreds armour, but can miss. Has a <Ability:SelfCooldown/> turn cooldown."
LocHelpText="Deal a select amount of damage and shred the target's armour. Attack can miss."
LocFlyOverText="Lanced"
LocPromotionPopupText="<Bullet/>Deal a select amount of damage and shred the target's armour. Attack can miss.<br/> <Bullet/> Damage and armour shredding scales with the tech level of the amp the biotic has equipped.<br/><Bullet/>Has a <Ability:SelfCooldown/> turn cooldown.<br/>"

[RM_Reave X2AbilityTemplate]
LocFriendlyName="Reave"
LocLongDescription="A biotic can mess with the neurons of an organic target, damaging it and strengthening the biotic's barrier at the same time. Has a <Ability:SelfCooldown/> turn cooldown."
LocHelpText="Deal a select amount of damage and gain shield points from the ensuring damage."
LocFlyOverText="Reaved"
LocPromotionPopupText="<Bullet/>Deal a select amount of damage and gain shield points from the ensuring damage.<br/> <Bullet/> Damage and shield points gained scales with the tech level of the amp the biotic has equipped.<br/><Bullet/>Will also gain an additional shield point for every 50 points of psi offense.<br/><Bullet/>Has a <Ability:SelfCooldown/> turn cooldown, and will end the biotic's turn when used.<br/>"

[RM_ExposingBiotics X2AbilityTemplate]
LocFriendlyName="Exposure"
LocLongDescription="All biotic attacks that don't naturally rupture, will now rupture for +<Ability:Exposure_Rupture/>."
LocHelpText="All biotic attacks that don't naturally rupture, will now rupture for +<Ability:Exposure_Rupture/>."
LocFlyOverText="Exposed"
LocPromotionPopupText="<Bullet/> Rupture will apply after the base damage has been done.<br/>"

[RM_ConsumingBiotics X2AbilityTemplate]
LocFriendlyName="Reaving Biotics"
LocLongDescription="All biotic attacks that don't naturally reave, will now reave the target to give the biotic +<Ability:REAVE/> shield points."
LocHelpText="All biotic attacks that don't naturally reave, will now reave the target to give the biotic +<Ability:REAVE/> shield points."
LocFlyOverText="Reaved"
LocPromotionPopupText="<Bullet/> All biotic attacks that don't naturally reave, will now reave the target to give the biotic +<Ability:REAVE/> shield points.<br/>"

[RM_DevastatingBiotics X2AbilityTemplate]
LocFriendlyName="Devastating Biotics"
LocLongDescription="All biotic attacks, including rupture-only ones will now do bonus damage."
LocHelpText="All biotic attacks, including rupture-only ones will now do bonus damage"
LocFlyOverText="Devastated"
LocPromotionPopupText="<Bullet/>The bonus damage is only 1 HP, but will occur after any rupture, whether from the ability itself or from Exposure.<br/>"

[RM_Singularity X2AbilityTemplate]
LocFriendlyName="Singularity"
LocFlyOverText="Singularity"
LocLongDescription="Generate a miniature singularity that pulls in most units in its radius. The size of the radius is influenced by the Biotic's Psi score. Ruptures all units in the radius, even if not pulled."
LocHelpText="Generate a miniature singularity that pulls in most units in its radius. Deals at least +6 rupture."
LocPromotionPopupText="<Bullet/> Generate a miniature singularity that pulls in most units in its radius.<br/><Bullet/> The size of the radius is influenced by the Biotic's psi score.<br/><Bullet/> Cover may block the effect, depending on its height.<br/><Bullet/> The following units are immune: Gatekeeper, Sectopod, Avatar.<br/><Bullet/> Does not trigger Overwatch.<br/><Bullet/> Singularity has a <Ability:SelfCooldown/> turn cooldown.<br/><Bullet/> Using this ability will end the caster's turn."



; *********************************************************************************************************************
; ***						      WEAPONS																			***
; *********************************************************************************************************************


[RM_BioAmp_CV X2WeaponTemplate]
FriendlyName="Biotic Amp"
FriendlyNamePlural="Biotic Amps"
BriefSummary=""
TacticalText="<Bullet/> A Biotic Amp allows Biotics to perform their biotic abilities.\n<Bullet/> More advanced Biotic Amps can increase the biotic's psionic strength, and the effective ness of their abilities."

[RM_BioAmp_MG X2WeaponTemplate]
FriendlyName="Advanced Biotic Amp"
FriendlyNamePlural="Advanced Biotic Amps"
BriefSummary="This evolved version of the Biotic Amp channels the user's dark energy far more clearly, enabling greater biotic strength in our operatives. Psi Offense and biotic attack damage of some abilities is improved when carrying this advanced amplifier."
TacticalText="<Bullet/> The Advanced Biotic Amp increases a Biotic's psionic strength by +20.\n<Bullet/> Psi Strength determines the potency of some of your biotic abilities.\n<Bullet/> The Advanced Biotic Amp also increases the damage done by many biotic attacks.\n"

[RM_BioAmp_BM X2WeaponTemplate]
FriendlyName="Elerium Biotic Amp"
FriendlyNamePlural="Elerium Biotic Amps"
BriefSummary="This version of the Biotic Amplifier incorporates the alien element Elerium-117, along with technology from the powerful \"Gatekeeper\" alien we encountered. It will enable our biotics to compete with the strongest of the Aliens' psionic forces."
TacticalText="<Bullet/> The Elerium Biotic Amp increases a Biotic's psionic strength by +40.\n<Bullet/> Psi Strength determines the potency of some of your biotic abilities.<Bullet/> The Elerium Biotic Amp also increases the damage done by many biotic attacks.\n"



[RM_Biotic X2EncyclopediaTemplate]
ListTitle="Biotic Class"
DescriptionTitle="Biotic Class"
DescriptionEntry="Biotics are a special breed of soldier: they've been gifted with the ability to maniuplate their surroundings with dark energy, enabling them to shred armour, charge and disable groups of hostiles, and more with purely their body. However, this gift is extremely rare: we can't train people to being a biotic, they need to have been exposed to element zero during early childhood or in-utero."
